x = int(input("Введите начальную координату Х:"))
y = int(input("Введите начальную координату Y:"))
x2 = int(input("Введите конечную координату Х:"))
y2 = int(input("Введите конечную координату Y:"))
a = [x, y]
b = [x2, y2]
if (a[0] == b[0] and a[1] == b[1]) or (a[0] > 8 or b[0] > 8 or a[1] > 8 or b[1] > 8 or (a[0] <= 0 or b[0] <= 0  or a[1] <= 0 or b[1] <= 0 )):
    print("Вы чего, ребят?")
else:
    if a[0] == b[0] or a[1] == b[1]:
        print("Можно так ходить")
    else:
        print("Неможно так ходить")
